In [10]:
import pandas as pd
import numpy as np

In [11]:
#Problem A START
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a','a','b','b'],[1,2,1,2]], columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [12]:
frame1 = frame.stack().stack()
frame2 = frame.unstack().unstack()

In [13]:
frame1

a  1  Green  Colorado     2.0
             Ohio         0.0
      Red    Ohio         1.0
   2  Green  Colorado     5.0
             Ohio         3.0
      Red    Ohio         4.0
b  1  Green  Colorado     8.0
             Ohio         6.0
      Red    Ohio         7.0
   2  Green  Colorado    11.0
             Ohio         9.0
      Red    Ohio        10.0
dtype: float64

In [14]:
frame2 = frame2.swaplevel(0,3).swaplevel(1,2)
frame2.sort_index(level=1)
#Problem A END

a  1  Green  Colorado     2
             Ohio         0
      Red    Ohio         1
b  1  Green  Colorado     8
             Ohio         6
      Red    Ohio         7
a  2  Green  Colorado     5
             Ohio         3
      Red    Ohio         4
b  2  Green  Colorado    11
             Ohio         9
      Red    Ohio        10
dtype: int64

In [15]:
#Problem B Start
left = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'Name1': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 'subject_id': ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']})
right = pd.DataFrame({'id': [1, 2, 3, 4, 5], 'Name2': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 'subject_id': ['sub2', 'sub4', 'sub3', 'sub5', 'sub6']})

In [19]:
df_union = pd.merge(left,right,on='subject_id',how='outer')

In [17]:
df_union

   id_x   Name1 subject_id  id_y  Name2
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   5.0  Betty
4   5.0  Ayoung       sub5   4.0  Bryce
5   NaN     NaN       sub3   3.0   Bran

In [55]:
df_union.isnull().any(1)
df_union[df_union.isnull().any(1)]

   id_x Name1 subject_id  id_y Name2
0   1.0  Alex       sub1   NaN   NaN
5   NaN   NaN       sub3   3.0  Bran